---
type: Opening
namespace: Autodesk.Revit.DB
version: 2024
members: 8
tags: [revit-api, class]
---

# Opening

`Autodesk.Revit.DB.Opening` · Revit 2024 · 8 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | BoundaryCurves | — | `public CurveArray BoundaryCurves { get ; }` |
| Property | BoundaryRect | — | `public IList < XYZ > BoundaryRect { get ; }` |
| Property | Host | — | `public Element Host { get ; }` |
| Property | IsRectBoundary | — | `public bool IsRectBoundary { get ; }` |
| Property | IsTransparentIn3D | — | `public bool IsTransparentIn3D { get ; set ; }` |
| Property | IsTransparentInElevation | — | `public bool IsTransparentInElevation { get ; set ; }` |
| Property | Parameter | — | `` |
| Property | SketchId | 2022 | `public ElementId SketchId { get ; }` |